app/Controllers/Home.php

INSERT INTO `customers` (`name`, `email`, `gender`, `password`, `designation`, `experience`, `qulification`, `mobile`, `address`, `city`, `pincode`, `state`, `country`) VALUES ('Kishan Maddeshiya', 'pkmad007@gmail.com', 'male', '$2y$10$ma9NJXiWVY4p0HlyOI4/y.Pkt3BBZzobvJTsYdMdTeMowj7oONTi.', 'Backend Develeper', 12, '12th', 7900930981, '13/201E/3\r\nNunhai', 'Agra', 282006, 'Uttar Pradesh', 'India')
---
                // Save to DB
                $model = new CustomerModel();

                $dataF = $model->save($dataToInsert);