app/Models/CustomerModel.php

SELECT *
FROM `customers`
WHERE `id` = '1'
 LIMIT 1
---
    public function fetchRecord($id)
    {
        // Select * form customers where id = $id;
        return $this->where('id', $id)->first();